# Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить, к какому времени года относится месяц#
a = input("Введите номер месяца: ")
s = ["6", "7", "8"]
w = ["12", "1", "2"]
sp = ["3", "4", "5"]
au = ["9", "10", "11"]
for i in s:
    if i == a:
        print("лето")
for i in w:
    if i == a:
        print("зима")
for i in sp:
    if i == a:
        print("весна")
for i in au:
    if i == a:
        print("осень")
